service/updateservice-ws/src/test/resources/dk/dbc/validateservice/ws/wrong_record_schema.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://oss.dbc.dk/ns/openCatalogingValidate/20140306" xmlns:ns1="http://oss.dbc.dk/ns/openCataloging/DataContracts/20140306">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:validate>
            <ns:validationRequest>
                <ns1:validateSchema>bog</ns1:validateSchema>
                <ns1:bibliographicalRecord>
                    <ns1:recordSchema>info:dc</ns1:recordSchema>
                    <ns1:recordPacking>xml</ns1:recordPacking>
                    <ns1:recordData>
                        DC
                    </ns1:recordData>
                    <!--Optional:-->
                    <ns1:extraRecordData>
                       cum
                       <!--You may enter ANY elements at this point-->
                       sonoras
                    </ns1:extraRecordData>
                </ns1:bibliographicalRecord>
            </ns:validationRequest>
        </ns:validate>
    </soapenv:Body>
</soapenv:Envelope>
